<template>
    <div class="w-[80%] bg-[#f9f9f9]">
        <div v-if="loadPage">
            <div class="rtl-d px-10 pt-28">
                <h1 class="text-xl font-bold text-site-blue mb-5">اختيار الاسرة في الخيام</h1>
                <hr>
                <div class="w-full p-4 border border-[#DADADA] rounded-2xl flex items-center gap-4">
                    <div class="w-1/3 flex flex-col items-center gap-4">
                        <div class="flex flex-col items-center w-full py-8 border-site-dark-blue border bg-site-blue bg-opacity-25 rounded-md">
                            <svg width="61" height="81" viewBox="0 0 61 81" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M40.9685 39.2793L32.5 74.489L37.2227 76.0394L47.3545 75.223L46.8636 52.4861L40.9685 39.2793Z" fill="#2F2F2F"/>
                                <path d="M17.0335 28.0275C16.4045 28.6539 14.8842 35.8553 11.2004 45.7146C7.51656 55.5738 2.78906 68.6224 2.78906 68.6224C2.78906 68.6224 3.34187 69.6792 10.3378 73.0268C17.3337 76.3743 23.1145 77.8425 23.1145 77.8425C23.1145 77.8425 38.698 45.6323 38.822 44.9046C38.9459 44.1705 41.4335 30.7422 41.4335 30.7422C41.4335 30.7422 31.5163 29.8246 27.2177 29.3374C22.9191 28.8501 17.7674 27.2934 17.0335 28.0275Z" fill="#F19F40"/>
                                <path d="M52.6109 75.1527L57.8436 73.9693C57.8436 73.9693 53.016 60.56 50.3759 53.7952C47.7357 47.0305 43.1798 32.672 42.7509 31.6152C42.322 30.5584 40.5396 30.0648 39.7438 31.9442C38.9479 33.8237 32.3046 53.1814 31.056 56.2759C29.6502 59.7563 22.6638 76.8992 22.6018 77.7978C22.5399 78.6964 34.3634 77.2093 34.3634 77.2093L37.4134 65.2808L41.0972 44.0879L41.712 44.2524L44.6571 61.5345L52.6109 75.1527Z" fill="#EC5F32"/>
                                <path d="M37.8041 76.6462C37.6993 77.4688 34.5826 78.1839 32.8098 78.2345C31.0322 78.2915 27.8535 78.456 27.4818 77.9055C27.1101 77.3549 31.4849 72.2038 34.2966 65.458C37.1036 58.7123 38.7573 54.0548 39.1671 52.188C39.5817 50.3212 40.4062 44.7334 40.735 43.7969C41.0638 42.8603 41.7262 43.0312 41.9312 43.9044C42.1361 44.7841 44.2854 55.5862 45.0288 58.1617C45.7723 60.7373 48.827 66.1098 49.7373 67.8121C50.6475 69.5144 55.1463 74.0453 55.2273 74.4819C55.3083 74.9186 52.4441 76.2538 50.495 76.5512C49.0987 76.7601 45.8438 76.4373 45.5959 75.8868C45.3481 75.3362 43.6659 60.7373 43.0463 55.8583C42.4268 50.9793 41.3545 44.455 41.3545 44.455C41.3545 44.455 38.9193 60.1361 38.5857 64.3063C38.2569 68.4766 37.9662 75.3299 37.8041 76.6462ZM2 62.3446C2 62.3446 2.34789 61.8637 3.00555 61.8067C3.6632 61.7561 4.24461 62.2876 4.24461 62.2876L4.66875 70.4003C4.66875 70.4003 4.16359 70.9888 3.54406 70.9888C2.92453 70.9888 2.34313 70.5585 2.34313 70.5585L2 62.3446ZM19.7567 70.5016C19.7567 70.5016 20.2952 69.9004 21.1197 69.9004C21.9441 69.9004 22.5637 70.4509 22.5637 70.4509L22.6066 78.6775C22.6066 78.6775 21.9441 79.1711 21.4485 79.1711C20.9529 79.1711 20.1666 78.842 20.1666 78.842L19.7567 70.5016ZM56.7094 66.8882C56.7094 66.8882 57.1526 66.2048 57.9389 66.2554C58.7252 66.306 59.1541 66.6667 59.1541 66.6667L58.7824 75.1084C58.7824 75.1084 58.4917 75.659 57.7912 75.659C57.0906 75.659 56.4711 75.2223 56.4711 75.2223L56.7094 66.8882Z" fill="#9C2D1B"/>
                            </svg>
                            <h1 class="text-xl text-site-blue w-full text-center py-2 rounded-md font-semibold " >خيمة منى</h1>
                        </div>
                        <RouterLink to="/hajjpage-notifications-manualchoosing-bed" class="text-xl text-white bg-site-blue w-full text-center py-2 rounded-md font-semibold " >اختيار السرير</RouterLink>
                    </div>
                    <div class="w-1/3 flex flex-col items-center gap-4">
                        <div class="flex flex-col items-center w-full py-8 border-site-dark-blue border bg-site-blue bg-opacity-25 rounded-md">
                            <svg width="61" height="81" viewBox="0 0 61 81" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M40.9685 39.2793L32.5 74.489L37.2227 76.0394L47.3545 75.223L46.8636 52.4861L40.9685 39.2793Z" fill="#2F2F2F"/>
                                <path d="M17.0335 28.0275C16.4045 28.6539 14.8842 35.8553 11.2004 45.7146C7.51656 55.5738 2.78906 68.6224 2.78906 68.6224C2.78906 68.6224 3.34187 69.6792 10.3378 73.0268C17.3337 76.3743 23.1145 77.8425 23.1145 77.8425C23.1145 77.8425 38.698 45.6323 38.822 44.9046C38.9459 44.1705 41.4335 30.7422 41.4335 30.7422C41.4335 30.7422 31.5163 29.8246 27.2177 29.3374C22.9191 28.8501 17.7674 27.2934 17.0335 28.0275Z" fill="#F19F40"/>
                                <path d="M52.6109 75.1527L57.8436 73.9693C57.8436 73.9693 53.016 60.56 50.3759 53.7952C47.7357 47.0305 43.1798 32.672 42.7509 31.6152C42.322 30.5584 40.5396 30.0648 39.7438 31.9442C38.9479 33.8237 32.3046 53.1814 31.056 56.2759C29.6502 59.7563 22.6638 76.8992 22.6018 77.7978C22.5399 78.6964 34.3634 77.2093 34.3634 77.2093L37.4134 65.2808L41.0972 44.0879L41.712 44.2524L44.6571 61.5345L52.6109 75.1527Z" fill="#EC5F32"/>
                                <path d="M37.8041 76.6462C37.6993 77.4688 34.5826 78.1839 32.8098 78.2345C31.0322 78.2915 27.8535 78.456 27.4818 77.9055C27.1101 77.3549 31.4849 72.2038 34.2966 65.458C37.1036 58.7123 38.7573 54.0548 39.1671 52.188C39.5817 50.3212 40.4062 44.7334 40.735 43.7969C41.0638 42.8603 41.7262 43.0312 41.9312 43.9044C42.1361 44.7841 44.2854 55.5862 45.0288 58.1617C45.7723 60.7373 48.827 66.1098 49.7373 67.8121C50.6475 69.5144 55.1463 74.0453 55.2273 74.4819C55.3083 74.9186 52.4441 76.2538 50.495 76.5512C49.0987 76.7601 45.8438 76.4373 45.5959 75.8868C45.3481 75.3362 43.6659 60.7373 43.0463 55.8583C42.4268 50.9793 41.3545 44.455 41.3545 44.455C41.3545 44.455 38.9193 60.1361 38.5857 64.3063C38.2569 68.4766 37.9662 75.3299 37.8041 76.6462ZM2 62.3446C2 62.3446 2.34789 61.8637 3.00555 61.8067C3.6632 61.7561 4.24461 62.2876 4.24461 62.2876L4.66875 70.4003C4.66875 70.4003 4.16359 70.9888 3.54406 70.9888C2.92453 70.9888 2.34313 70.5585 2.34313 70.5585L2 62.3446ZM19.7567 70.5016C19.7567 70.5016 20.2952 69.9004 21.1197 69.9004C21.9441 69.9004 22.5637 70.4509 22.5637 70.4509L22.6066 78.6775C22.6066 78.6775 21.9441 79.1711 21.4485 79.1711C20.9529 79.1711 20.1666 78.842 20.1666 78.842L19.7567 70.5016ZM56.7094 66.8882C56.7094 66.8882 57.1526 66.2048 57.9389 66.2554C58.7252 66.306 59.1541 66.6667 59.1541 66.6667L58.7824 75.1084C58.7824 75.1084 58.4917 75.659 57.7912 75.659C57.0906 75.659 56.4711 75.2223 56.4711 75.2223L56.7094 66.8882Z" fill="#9C2D1B"/>
                            </svg>
                            <h1 class="text-xl text-site-blue w-full text-center py-2 rounded-md font-semibold " >خيمة عرفات</h1>
                        </div>
                        <RouterLink to="/hajjpage-notifications-manualchoosing-bed" class="text-xl text-white bg-site-blue w-full text-center py-2 rounded-md font-semibold " >اختيار السرير</RouterLink>
                    </div>
                    <div class="w-1/3 flex flex-col items-center gap-4">
                        <div class="flex flex-col items-center w-full py-8 bg-site-text-grey bg-opacity-25 rounded-md">
                            <svg width="61" height="81" viewBox="0 0 61 81" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M40.9685 39.2793L32.5 74.489L37.2227 76.0394L47.3545 75.223L46.8636 52.4861L40.9685 39.2793Z" fill="#2F2F2F"/>
                                <path d="M17.0335 28.0275C16.4045 28.6539 14.8842 35.8553 11.2004 45.7146C7.51656 55.5738 2.78906 68.6224 2.78906 68.6224C2.78906 68.6224 3.34187 69.6792 10.3378 73.0268C17.3337 76.3743 23.1145 77.8425 23.1145 77.8425C23.1145 77.8425 38.698 45.6323 38.822 44.9046C38.9459 44.1705 41.4335 30.7422 41.4335 30.7422C41.4335 30.7422 31.5163 29.8246 27.2177 29.3374C22.9191 28.8501 17.7674 27.2934 17.0335 28.0275Z" fill="#F19F40"/>
                                <path d="M52.6109 75.1527L57.8436 73.9693C57.8436 73.9693 53.016 60.56 50.3759 53.7952C47.7357 47.0305 43.1798 32.672 42.7509 31.6152C42.322 30.5584 40.5396 30.0648 39.7438 31.9442C38.9479 33.8237 32.3046 53.1814 31.056 56.2759C29.6502 59.7563 22.6638 76.8992 22.6018 77.7978C22.5399 78.6964 34.3634 77.2093 34.3634 77.2093L37.4134 65.2808L41.0972 44.0879L41.712 44.2524L44.6571 61.5345L52.6109 75.1527Z" fill="#EC5F32"/>
                                <path d="M37.8041 76.6462C37.6993 77.4688 34.5826 78.1839 32.8098 78.2345C31.0322 78.2915 27.8535 78.456 27.4818 77.9055C27.1101 77.3549 31.4849 72.2038 34.2966 65.458C37.1036 58.7123 38.7573 54.0548 39.1671 52.188C39.5817 50.3212 40.4062 44.7334 40.735 43.7969C41.0638 42.8603 41.7262 43.0312 41.9312 43.9044C42.1361 44.7841 44.2854 55.5862 45.0288 58.1617C45.7723 60.7373 48.827 66.1098 49.7373 67.8121C50.6475 69.5144 55.1463 74.0453 55.2273 74.4819C55.3083 74.9186 52.4441 76.2538 50.495 76.5512C49.0987 76.7601 45.8438 76.4373 45.5959 75.8868C45.3481 75.3362 43.6659 60.7373 43.0463 55.8583C42.4268 50.9793 41.3545 44.455 41.3545 44.455C41.3545 44.455 38.9193 60.1361 38.5857 64.3063C38.2569 68.4766 37.9662 75.3299 37.8041 76.6462ZM2 62.3446C2 62.3446 2.34789 61.8637 3.00555 61.8067C3.6632 61.7561 4.24461 62.2876 4.24461 62.2876L4.66875 70.4003C4.66875 70.4003 4.16359 70.9888 3.54406 70.9888C2.92453 70.9888 2.34313 70.5585 2.34313 70.5585L2 62.3446ZM19.7567 70.5016C19.7567 70.5016 20.2952 69.9004 21.1197 69.9004C21.9441 69.9004 22.5637 70.4509 22.5637 70.4509L22.6066 78.6775C22.6066 78.6775 21.9441 79.1711 21.4485 79.1711C20.9529 79.1711 20.1666 78.842 20.1666 78.842L19.7567 70.5016ZM56.7094 66.8882C56.7094 66.8882 57.1526 66.2048 57.9389 66.2554C58.7252 66.306 59.1541 66.6667 59.1541 66.6667L58.7824 75.1084C58.7824 75.1084 58.4917 75.659 57.7912 75.659C57.0906 75.659 56.4711 75.2223 56.4711 75.2223L56.7094 66.8882Z" fill="#9C2D1B"/>
                            </svg>
                            <h1 class="text-xl text-site-blue w-full text-center py-2 rounded-md font-semibold " >خيمة مزدلفة</h1>
                        </div>
                        <h1 class="text-xl text-white bg-site-text-grey w-full text-center py-2 rounded-md font-semibold " >غير متاح</h1>
                    </div>
                </div>
            </div>
        </div>
        <div v-else class=" flex justify-center mt-52">
            <PageLoader />
        </div>
    </div>
</template>

<script setup>
import { onMounted, ref } from 'vue';
import { useUserStore } from '../../../../stores/user';
import { useGetRequest, usePatchRequest, usePostRequest } from '../../../../composables/useRequest';
import { RouterLink, useRoute, useRouter } from 'vue-router';
import PageLoader from '../../../../components/icon/PageLoader.vue';
import Select from 'primevue/select';

const router = useRouter()
const route = useRoute()
const user = useUserStore()
const loadPage = ref(false)
const groupObj = ref({
    subscriber_company: user.userCompantId,
    name_ar: null,
    name_en: null,
    capacity: null,
    number_location: null,
    phone: null,
    number_man: null,
    number_women: null,
    number_services: null,
    number_management: null,
    have_train: null,
    url_location_munaa: null,
    address_munaa: null,
    url_location_earafah: null,
    address_earafah: null,
    url_location_muzdalifah: null,
    address_muzdalifah: null,
})
const requestConditions = ref({
    data: null,
    error: null,
    loading: false,
})

onMounted(async ()=>{
/*     if(route.params.id != 'add') {
        const {Data, Error} = await useGetRequest('api/v1/group/'+route.params.id)
        groupObj.value = Data.value.data
        loadPage.value = true
    }
    else {
        loadPage.value = true
    } */
    loadPage.value = true
})

const addGroup = async () => {
    requestConditions.value.loading = true
    if(route.params.id == 'add') {
        const { Data, Error } = await usePostRequest('api/v1/group/',groupObj.value)
        requestConditions.value.error = Error?.value?.errors
        requestConditions.value.data = Data.value
    }
    else {
        const { Data, Error } = await usePatchRequest('api/v1/group/'+route.params.id+'/',groupObj.value)
        requestConditions.value.error = Error?.value?.errors
        requestConditions.value.data = Data.value
    }
/*     if(requestConditions.value.error != null) {
        requestConditions.value.loading = false
    }
    else {
        router.push('/company-location')
    } */
}
</script>

<style>
.dp__input {
    background: #f9f9f9 !important;
}
</style>